<!-- dflook/terraform-github-actions {"workspace":"STRWIKER","backend_type":"remote","backend":"1565ef75cbe5d1e413a6b974824197d591169bfec67f9e4a80bcf4eba196967a","plan_job_ref":"Job Terraform Plan #152 at https://github.com/amc40/STRWIKER/actions/runs/22092256486","plan_hash":"f00d4853b1011691b47459178f1442ee95b3f5629a4d80a5cf550979569e2545","plan_text_format":"diff","version":"2.2.3","plan_out_hash":"ab47608c8def93f435c8231e1a64c9bc318d05337613517603014215a8992e79","closed":true} -->
Terraform plan in __terraform__ in the __STRWIKER__ workspace<details open><summary>With variables</summary>

```hcl
github_owner                       = "amc40"
github_repository_name             = "STRWIKER"
supabase_access_token              = (sensitive value)
supabase_database_password         = (sensitive value)
supabase_organization_id           = "wmjgrzvldhnebgmdcwmk"
supabase_staging_database_password = (sensitive value)
vercel_api_token                   = (sensitive value)
```
</details>
<details>
<summary>Plan: 6 to add, 3 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.supabase_staging_project.data.supabase_apikeys.main will be read during apply
 <= data "supabase_apikeys" "main" {
+       anon_key         = (sensitive value)
+       project_ref      = (known after apply)
+       publishable_key  = (sensitive value)
+       secret_keys      = (sensitive value)
+       service_role_key = (sensitive value)
    }

  # module.supabase_staging_project.supabase_project.main will be created
+   resource "supabase_project" "main" {
+       database_password = (sensitive value)
+       id                = (known after apply)
+       instance_size     = (known after apply)
+       name              = "strwiker-staging"
+       organization_id   = "********************"
+       region            = "eu-west-2"
    }

  # module.vercel_project_custom.vercel_project_environment_variable.postgres_prisma_url["preview"] will be created
+   resource "vercel_project_environment_variable" "postgres_prisma_url" {
+       comment                = (known after apply)
+       custom_environment_ids = (known after apply)
+       id                     = (known after apply)
+       key                    = "POSTGRES_PRISMA_URL"
+       project_id             = "********************************"
+       sensitive              = true
+       target                 = [
+           "preview",
        ]
+       team_id                = (known after apply)
+       value                  = (sensitive value)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.postgres_prisma_url["production"] will be updated in-place
  # (moved from module.vercel_project_custom.vercel_project_environment_variable.postgres_prisma_url)
!~  resource "vercel_project_environment_variable" "postgres_prisma_url" {
+       comment                = (known after apply)
        id                     = "Bq3SEPIBZOf1hZd2"
!~      target                 = [
-           "preview",
#            (1 unchanged element hidden)
        ]
+       team_id                = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.postgres_url_non_pooling["preview"] will be created
+   resource "vercel_project_environment_variable" "postgres_url_non_pooling" {
+       comment                = (known after apply)
+       custom_environment_ids = (known after apply)
+       id                     = (known after apply)
+       key                    = "POSTGRES_URL_NON_POOLING"
+       project_id             = "********************************"
+       sensitive              = true
+       target                 = [
+           "preview",
        ]
+       team_id                = (known after apply)
+       value                  = (sensitive value)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.postgres_url_non_pooling["production"] will be updated in-place
  # (moved from module.vercel_project_custom.vercel_project_environment_variable.postgres_url_non_pooling)
!~  resource "vercel_project_environment_variable" "postgres_url_non_pooling" {
+       comment                = (known after apply)
        id                     = "0aDFZZAnZ0uWzn26"
!~      target                 = [
-           "preview",
#            (1 unchanged element hidden)
        ]
+       team_id                = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.supabase_anon_key["preview"] will be created
+   resource "vercel_project_environment_variable" "supabase_anon_key" {
+       comment                = (known after apply)
+       custom_environment_ids = (known after apply)
+       id                     = (known after apply)
+       key                    = "NEXT_PUBLIC_SUPABASE_ANON_KEY"
+       project_id             = "********************************"
+       sensitive              = true
+       target                 = [
+           "preview",
        ]
+       team_id                = (known after apply)
+       value                  = (sensitive value)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.supabase_anon_key["production"] will be updated in-place
  # (moved from module.vercel_project_custom.vercel_project_environment_variable.supabase_anon_key)
!~  resource "vercel_project_environment_variable" "supabase_anon_key" {
+       comment                = (known after apply)
        id                     = "r7qlV3sc3auSLyVf"
!~      target                 = [
-           "preview",
#            (1 unchanged element hidden)
        ]
+       team_id                = (known after apply)
#        (5 unchanged attributes hidden)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.supabase_url["preview"] will be created
+   resource "vercel_project_environment_variable" "supabase_url" {
+       comment                = (known after apply)
+       custom_environment_ids = (known after apply)
+       id                     = (known after apply)
+       key                    = "NEXT_PUBLIC_SUPABASE_URL"
+       project_id             = "********************************"
+       sensitive              = (known after apply)
+       target                 = [
+           "preview",
        ]
+       team_id                = (known after apply)
+       value                  = (sensitive value)
    }

  # module.vercel_project_custom.vercel_project_environment_variable.supabase_url["production"] must be replaced
  # (moved from module.vercel_project_custom.vercel_project_environment_variable.supabase_url)
-/+ resource "vercel_project_environment_variable" "supabase_url" {
+       comment                = (known after apply)
!~      custom_environment_ids = [] -> (known after apply)
!~      id                     = "****************" -> (known after apply)
!~      sensitive              = false # forces replacement -> (known after apply) # forces replacement
!~      target                 = [
-           "preview",
#            (1 unchanged element hidden)
        ]
+       team_id                = (known after apply)
#        (3 unchanged attributes hidden)
    }

Plan: 6 to add, 3 to change, 1 to destroy.

Changes to Outputs:
+   staging_environment_variables = (sensitive value)
+   supabase_staging_api_url      = (known after apply)
+   supabase_staging_project_id   = (known after apply)
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #12](https://github.com/amc40/STRWIKER/actions/runs/22133235842)
<details><summary>Outputs</summary>

```hcl
environment_variables         = (sensitive value)
staging_environment_variables = (sensitive value)
supabase_api_url              = "https://jepjihyrkmfajvwsvzbn.supabase.co"
supabase_project_id           = "jepjihyrkmfajvwsvzbn"
supabase_staging_api_url      = "https://ljaihiaxtocaqnuvtcps.supabase.co"
supabase_staging_project_id   = "ljaihiaxtocaqnuvtcps"
vercel_project_id             = "prj_MD4ZJS6Gch8UNekuD9goUDM5NBxk"
vercel_project_name           = "strwiker"
```
</details>